Revit 2026 API

# GridSegmentDirection Enumeration

---

Specify one of the four adjacent segments to a GridNode. See DividedSurface.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum GridSegmentDirection
```
```vb
Public Enumeration GridSegmentDirection
```
```cpp
public enum class GridSegmentDirection
```
```fsharp
type GridSegmentDirection
```

| Member name | Value | Description |
| --- | --- | --- |
| NegativeU | 1 |  |
| NegativeV | 3 |  |
| PositiveU | 0 |  |
| PositiveV | 2 |  |

#### Reference

Autodesk.Revit.DB Namespace